import {Link} from 'react-router-dom'
import styled from "styled-components";
import Footer from "../components/Footer";
import about1 from '../images/about-11.jpg'
import about2 from '../images/about-14.jpg'
import about3 from '../images/about-6.jpg'
import about4 from '../images/about-8.jpg'

const About = () => {
    return (
        <main>
            <div>
                {/*<img src={} alt='head'/>*/}
                <h2>Профіль Тех</h2>
                <Link to='/' className='btn'>
                    Back Home
                </Link>
            </div>
            <Wrapper className='page section section-center'>
                <img src={about1} alt='nice desc'/>
                <article>
                    <div className='title'>
                        <h2>ПРО КОМПАНІЮ</h2>
                        <div className='underline'></div>
                    </div>
                    <div>
                        <p>
                            Виробнича компанія «Профільтех» була створена 26 серпня 2010 року.
                            У вересні 2010 року було встановлено обладнання з виробництва профільованого
                            листа з оцинкованої сталі та сталі з полімерним покриттям, а також профілів для
                            гіпсокартону. За короткий час компанія зарекомендувала себе перед своїми
                            клієнтами як надійного партнера, що динамічно розвивається.
                            Ми виготовляємо профнастил методом холодного прокату з оцинкованого та фарбованого
                            металу з плівковим покриттям або без нього, будь-якого розміру: ПС-8, ПС-10,
                            ПС-12, ПС-20, ПК-20, ПК-35, ПК-45, Н-57.
                            Виробнича компанія «Профільтех» використовує високоякісну сировину як
                            вітчизняного виробництва, так і закордонного.
                            Постачальниками металу ТОВ «Профільтех» є найбільші металургійні комбінати з
                            ближнього та далекого зарубіжжя.
                            Персонал компанії вирізняється високою кваліфікацією та доброзичливим ставленням
                            до клієнтів. Співробітники завжди готові надати повну консультацію щодо застосування
                            продукції.
                        </p>
                    </div>
                </article>
            </Wrapper>
            <Wrapper className='page section section-center'>
                <article>
                    <div className='title'>
                        <h2>ОСНОВНІ НАПРЯМКИ ДІЯЛЬНОСТІ:</h2>
                        <div className='underline'></div>
                    </div>
                    <div>
                        <p>
                            <ol>
                                <li>Виробництво гнутих металевих профілів для монтажу гіпсокартону CD-60, UD-27, CW-100,
                                    75, 50 UW – 100, 75, 50.
                                </li>
                                <li>Виробництво профнастилу: ПС-8, ПС-10, ПС-12, ПС-20, ПК-20, ПК-35, ПК-45, Н-57 (з
                                    оцинкованого металу та металу з полімерним покриттям).
                                </li>
                                <li>Виробництво металочерепиці “МОНАКО” та “РІО” з металу з полімерним покриттям.</li>
                                <li>Виробництво комплектуючих відбірних елементів для профнастилу із гнутого металу.
                                </li>
                                <li>Виробництво оцинкованого омега профілю та профільної труби.</li>
                                <li>Оптова та роздрібна торгівля широким асортиментом будівельних матеріалів.</li>
                            </ol>
                            ТОВ «Профільтех» є найбільшим виробником продуктів із тонколистового прокату за переліком
                            обладнання у Житомирській,
                            Вінницькій, Рівненській та Хмельницькій областях, що вигідно виділяє нас серед конкурентів.
                            Досить великий об’єм закупівлі металу і наявність 11 прокатних станів дозволяє мати широкий
                            асортимент профнастилу
                            та металочерепиці (у т.ч. і за кольорами). Ми гарантуємо Вам якість, доступні ціни та
                            індивідуальний підхід!
                        </p>
                    </div>
                </article>
                <img src={about2} alt='nice desc'/>
            </Wrapper>
            <Wrapper className='page section section-center'>
                <img src={about3} alt='nice desc'/>
                <article>
                    <div className='title'>
                        <h2>ЧОМУ ВИГІДНО ПРАЦЮВАТИ З НАМИ?</h2>
                        <div className='underline'></div>
                    </div>
                    <div>
                        <p>
                            Металопродукція і металопрокат за ціною виробника
                            Профільтех – одна із провідних вітчизняних компаній, яка є виробником та імпортером
                            продукції будівельних
                            матеріалів і продукції з металу. Ми працюємо в цій сфері більше 12 років, успішно
                            співпрацюючи з підприємствами
                            України та країн Європи, а також Китаєм. Позиції лідера нам допомагають зберегти такі
                            чинники:
                            <ol>
                                <li>Ретельне відстеження тенденцій ринку;</li>
                                <li>Оновлення асортименту, виходячи зі змін попиту;</li>
                                <li>Розвиток нових перспективних напрямків;</li>
                                <li>Нарощування виробничих потужностей;</li>
                                <li>Висока якість пропонованих виробів.</li>
                            </ol>
                            Крім цього, ми маємо власні складські приміщення зі зручним під’їздом та стежимо, щоб на них
                            постійно була в наявності
                            готова продукція. Усе це дозволяє швидко обробляти замовлення, а наявність власного
                            транспорту – доставляти їх у найкоротші терміни.
                        </p>
                    </div>
                </article>
            </Wrapper>
            <Wrapper className='page section section-center'>
                <article>
                    <div className='title'>
                        <h2>ЧОМУ ВИГІДНО ПРАЦЮВАТИ З НАМИ?</h2>
                        <div className='underline'></div>
                    </div>
                    <div>
                        <p>
                            Металопродукція і металопрокат за ціною виробника
                            Профільтех – одна із провідних вітчизняних компаній, яка є виробником та імпортером
                            продукції будівельних
                            матеріалів і продукції з металу. Ми працюємо в цій сфері більше 12 років, успішно
                            співпрацюючи з підприємствами
                            України та країн Європи, а також Китаєм. Позиції лідера нам допомагають зберегти такі
                            чинники:
                            <ol>
                                <li>Ретельне відстеження тенденцій ринку;</li>
                                <li>Оновлення асортименту, виходячи зі змін попиту;</li>
                                <li>Розвиток нових перспективних напрямків;</li>
                                <li>Нарощування виробничих потужностей;</li>
                                <li>Висока якість пропонованих виробів.</li>
                            </ol>
                            Крім цього, ми маємо власні складські приміщення зі зручним під’їздом та стежимо, щоб на них
                            постійно була в наявності
                            готова продукція. Усе це дозволяє швидко обробляти замовлення, а наявність власного
                            транспорту – доставляти їх у найкоротші терміни.
                        </p>
                    </div>
                </article>
                <img src={about4} alt='nice desc'/>
            </Wrapper>
            <Footer/>
        </main>
    );
};

const Wrapper = styled.section`
  display: grid;
  gap: 4rem;

  img {
    width: 100%;
    display: block;
    border-radius: var(--radius);
    height: 500px;
    object-fit: cover;
  }

  p {
    line-height: 2;
    max-width: 45em;
    margin: 0 auto;
    margin-top: 2rem;
    color: var(--clr-grey-5);
  }

  .title {
    text-align: left;
  }

  .underline {
    margin-left: 0;
  }

  @media (min-width: 992px) {
    grid-template-columns: 1fr 1fr;
  }
`

export default About;
//<i className='uil uil-fffffffff '></i>

